Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J21B.PIC
      <edc:SFRDef edc:_addr="0x40040004" edc:access="----nnnnn-----------------nn--nn" edc:cname="DACC_MR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAXS0" edc:desc="Max Speed Mode for Channel 0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="TRIG_EVENT" edc:desc="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Max speed mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXS1" edc:desc="Max Speed Mode for Channel 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="TRIG_EVENT" edc:desc="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Max speed mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WORD" edc:desc="Word Transfer Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="One data to convert is written to the FIFO per access to DACC." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ZERO" edc:desc="Must always be written to 0." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Differential Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="DAC0 and DAC1 are single-ended outputs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="DACP and DACN are differential outputs. The differential level is configured by the channel 0 value." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Peripheral Clock to DAC Clock Ratio" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040008" edc:access="---------nnn-nnn-----nnn-nnn--nn" edc:cname="DACC_TRIGR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGEN0" edc:desc="Trigger Enable of Channel 0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGEN1" edc:desc="Trigger Enable of Channel 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL0" edc:desc="Trigger Selection of Channel 0" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="DATRG" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TC0 output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TC1 output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TC2 output" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM0 event 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM0 event 1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL6" edc:desc="PWM1 event 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL7" edc:desc="PWM1 event 1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSEL1" edc:desc="Trigger Selection of Channel 1" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="DATRG" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TC0 output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TC1 output" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TC2 output" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM0 event 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM0 event 1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL6" edc:desc="PWM1 event 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL7" edc:desc="PWM1 event 1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OSR0" edc:desc="Over Sampling Ratio of Channel 0" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="OSR = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="OSR = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="OSR = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="OSR = 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="OSR = 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="OSR = 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR1" edc:desc="Over Sampling Ratio of Channel 1" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="OSR = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="OSR = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="OSR = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="OSR = 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="OSR = 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="OSR = 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004000C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40040010" edc:access="------------------------------ww" edc:cname="DACC_CHER" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040014" edc:access="------------------------------ww" edc:cname="DACC_CHDR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040018" edc:access="----------------------rr------rr" edc:cname="DACC_CHSR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DACRDY0" edc:desc="DAC Ready Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DACRDY1" edc:desc="DAC Ready Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004001C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DACC_CDR0" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data to Convert for channel 0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data to Convert for channel 1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040020" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DACC_CDR1" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data to Convert for channel 0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data to Convert for channel 1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
