Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J21B.PIC
      <edc:SFRDef edc:_addr="0x400E0664" edc:access="----------w--www-wwwwwww-w--w-ww" edc:cname="PMC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:desc="UTMI PLL Lock Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main RC Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0668" edc:access="----------rrrrrr-rrrrrrrrr--r-rr" edc:cname="PMC_SR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:desc="UTMI PLL Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:desc="Slow Clock Source Oscillator Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Clock Source Oscillator Selection Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main RC Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:desc="Clock Failure Detector Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:desc="Clock Failure Detector Fault Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:desc="Slow Crystal Oscillator Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E066C" edc:access="----------r--rrr-rrrrrrr-r--r-rr" edc:cname="PMC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOCKU" edc:desc="UTMI PLL Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:desc="Programmable Clock Ready 3 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY4" edc:desc="Programmable Clock Ready 4 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY5" edc:desc="Programmable Clock Ready 5 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY6" edc:desc="Programmable Clock Ready 6 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main RC Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="XT32KERR" edc:desc="32.768 kHz Crystal Oscillator Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0670" edc:access="--------nnnn-nnnnnnnnnnnnnnnnnnn" edc:cname="PMC_FSMR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:desc="Fast Startup Input Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:desc="Fast Startup Input Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:desc="Fast Startup Input Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:desc="Fast Startup Input Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:desc="Fast Startup Input Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:desc="Fast Startup Input Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:desc="Fast Startup Input Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:desc="Fast Startup Input Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:desc="Fast Startup Input Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:desc="Fast Startup Input Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:desc="Fast Startup Input Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:desc="Fast Startup Input Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:desc="Fast Startup Input Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:desc="Fast Startup Input Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:desc="Fast Startup Input Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:desc="Fast Startup Input Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:desc="RTT Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:desc="RTC Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBAL" edc:desc="USB Alarm Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:desc="Low-power Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:desc="Flash Low-power Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FFLPM" edc:desc="Force Flash Low-power Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0674" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMC_FSPR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSTP0" edc:desc="Fast Startup Input Polarity 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP1" edc:desc="Fast Startup Input Polarity 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP2" edc:desc="Fast Startup Input Polarity 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP3" edc:desc="Fast Startup Input Polarity 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP4" edc:desc="Fast Startup Input Polarity 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP5" edc:desc="Fast Startup Input Polarity 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP6" edc:desc="Fast Startup Input Polarity 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP7" edc:desc="Fast Startup Input Polarity 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP8" edc:desc="Fast Startup Input Polarity 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP9" edc:desc="Fast Startup Input Polarity 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP10" edc:desc="Fast Startup Input Polarity 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP11" edc:desc="Fast Startup Input Polarity 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP12" edc:desc="Fast Startup Input Polarity 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP13" edc:desc="Fast Startup Input Polarity 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP14" edc:desc="Fast Startup Input Polarity 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP15" edc:desc="Fast Startup Input Polarity 15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0678" edc:access="-------------------------------w" edc:cname="PMC_FOCR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:desc="Fault Output Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E067C" edc:offset="0x68"/>
      <edc:SFRDef edc:_addr="0x400E06E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PMC_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
